zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_sg01/pic32ck1025sg01144-pinctrl.h
#define PA13A_EIC_EXTINT13 MCHP_PINMUX(a, 13, a, periph)

#define PA13C_SERCOM5_PAD0 MCHP_PINMUX(a, 13, c, periph)

#define PA13E_EBI_D0 MCHP_PINMUX(a, 13, e, periph)

#define PA13F_TCC4_WO0 MCHP_PINMUX(a, 13, f, periph)

#define PA13M_CCL_IN9 MCHP_PINMUX(a, 13, m, periph)

#define PA14_GPIO MCHP_PINMUX(a, 14, gpio, gpio)

#define PA14A_EIC_EXTINT14 MCHP_PINMUX(a, 14, a, periph)

#define PA14C_SERCOM5_PAD1 MCHP_PINMUX(a, 14, c, periph)

#define PA14E_EBI_D1 MCHP_PINMUX(a, 14, e, periph)

#define PA14F_TCC4_WO1 MCHP_PINMUX(a, 14, f, periph)

#define PA14M_CCL_IN10 MCHP_PINMUX(a, 14, m, periph)

#define PA15_GPIO MCHP_PINMUX(a, 15, gpio, gpio)

#define PA15A_EIC_EXTINT15 MCHP_PINMUX(a, 15, a, periph)

#define PA15C_SERCOM5_PAD2 MCHP_PINMUX(a, 15, c, periph)

#define PA15E_EBI_D2 MCHP_PINMUX(a, 15, e, periph)

#define PA15F_TCC5_WO0 MCHP_PINMUX(a, 15, f, periph)

#define PA15M_CCL_IN11 MCHP_PINMUX(a, 15, m, periph)

#define PA16_GPIO MCHP_PINMUX(a, 16, gpio, gpio)

#define PA16A_EIC_EXTINT0 MCHP_PINMUX(a, 16, a, periph)

#define PA16C_SERCOM5_PAD3 MCHP_PINMUX(a, 16, c, periph)

#define PA16E_EBI_D3 MCHP_PINMUX(a, 16, e, periph)

#define PA16F_TCC5_WO1 MCHP_PINMUX(a, 16, f, periph)

#define PA16M_CCL_OUT3 MCHP_PINMUX(a, 16, m, periph)

#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

#define PA17E_EBI_D4 MCHP_PINMUX(a, 17, e, periph)

#define PA17M_GCLK_IO6 MCHP_PINMUX(a, 17, m, periph)

#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

#define PA18B_ADC_VINM4 MCHP_PINMUX(a, 18, b, periph)

#define PA18D_SERCOM6_PAD0 MCHP_PINMUX(a, 18, d, periph)

#define PA18F_TCC3_WO5 MCHP_PINMUX(a, 18, f, periph)

#define PA18N_PTC_ECI0 MCHP_PINMUX(a, 18, n, periph)

#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

#define PA19D_SERCOM6_PAD2 MCHP_PINMUX(a, 19, d, periph)

#define PA19F_TCC3_WO7 MCHP_PINMUX(a, 19, f, periph)

#define PA19N_PTC_ECI1 MCHP_PINMUX(a, 19, n, periph)

#define PA20_GPIO MCHP_PINMUX(a, 20, gpio, gpio)

#define PA20A_EIC_EXTINT4 MCHP_PINMUX(a, 20, a, periph)

#define PA20C_SERCOM7_PAD1 MCHP_PINMUX(a, 20, c, periph)

#define PA20F_TCC4_WO0 MCHP_PINMUX(a, 20, f, periph)

#define PA20G_PDEC_QDI0 MCHP_PINMUX(a, 20, g, periph)

#define PA20K_PCC_CLK MCHP_PINMUX(a, 20, k, periph)

#define PA20M_GCLK_IO2 MCHP_PINMUX(a, 20, m, periph)

#define PA21_GPIO MCHP_PINMUX(a, 21, gpio, gpio)

#define PA21A_EIC_EXTINT5 MCHP_PINMUX(a, 21, a, periph)

#define PA21C_SERCOM7_PAD0 MCHP_PINMUX(a, 21, c, periph)

#define PA21F_TCC4_WO1 MCHP_PINMUX(a, 21, f, periph)

#define PA21G_PDEC_QDI1 MCHP_PINMUX(a, 21, g, periph)

#define PA21K_PCC_DATA0 MCHP_PINMUX(a, 21, k, periph)

#define PA21M_GCLK_IO3 MCHP_PINMUX(a, 21, m, periph)

#define PA22_GPIO MCHP_PINMUX(a, 22, gpio, gpio)

#define PA22A_EIC_EXTINT6 MCHP_PINMUX(a, 22, a, periph)

#define PA22C_SERCOM7_PAD2 MCHP_PINMUX(a, 22, c, periph)

#define PA22F_TCC5_WO0 MCHP_PINMUX(a, 22, f, periph)

#define PA22G_PDEC_QDI2 MCHP_PINMUX(a, 22, g, periph)

#define PA22K_PCC_DATA1 MCHP_PINMUX(a, 22, k, periph)

#define PA22M_GCLK_IO4 MCHP_PINMUX(a, 22, m, periph)

#define PA23_GPIO MCHP_PINMUX(a, 23, gpio, gpio)

#define PA23A_EIC_EXTINT7 MCHP_PINMUX(a, 23, a, periph)

#define PA23C_SERCOM7_PAD3 MCHP_PINMUX(a, 23, c, periph)

#define PA23F_TCC5_WO1 MCHP_PINMUX(a, 23, f, periph)

#define PA23K_PCC_DATA2 MCHP_PINMUX(a, 23, k, periph)

#define PA23M_GCLK_IO5 MCHP_PINMUX(a, 23, m, periph)

#define PA24_GPIO MCHP_PINMUX(a, 24, gpio, gpio)

#define PA24A_EIC_EXTINT8 MCHP_PINMUX(a, 24, a, periph)

#define PA24C_SERCOM5_PAD0 MCHP_PINMUX(a, 24, c, periph)

#define PA24K_PCC_DATA3 MCHP_PINMUX(a, 24, k, periph)

#define PA24M_GCLK_IO7 MCHP_PINMUX(a, 24, m, periph)

#define PA25_GPIO MCHP_PINMUX(a, 25, gpio, gpio)

#define PA25A_EIC_EXTINT9 MCHP_PINMUX(a, 25, a, periph)

#define PA25C_SERCOM5_PAD1 MCHP_PINMUX(a, 25, c, periph)

#define PA25K_PCC_DATA4 MCHP_PINMUX(a, 25, k, periph)

#define PA26_GPIO MCHP_PINMUX(a, 26, gpio, gpio)

#define PA26A_EIC_EXTINT10 MCHP_PINMUX(a, 26, a, periph)

#define PA26C_SERCOM5_PAD2 MCHP_PINMUX(a, 26, c, periph)

#define PA26K_PCC_DATA5 MCHP_PINMUX(a, 26, k, periph)

#define PA27_GPIO MCHP_PINMUX(a, 27, gpio, gpio)

#define PA27A_EIC_EXTINT11 MCHP_PINMUX(a, 27, a, periph)

#define PA27C_SERCOM5_PAD3 MCHP_PINMUX(a, 27, c, periph)

#define PA27K_PCC_DATA6 MCHP_PINMUX(a, 27, k, periph)

#define PA28_GPIO MCHP_PINMUX(a, 28, gpio, gpio)

#define PA28A_EIC_EXTINT12 MCHP_PINMUX(a, 28, a, periph)

#define PA28D_SERCOM6_PAD1 MCHP_PINMUX(a, 28, d, periph)

#define PA28F_TCC3_WO6 MCHP_PINMUX(a, 28, f, periph)

#define PA28K_PCC_DATA7 MCHP_PINMUX(a, 28, k, periph)

#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

#define PB0B_ADC_VINP9 MCHP_PINMUX(b, 0, b, periph)

#define PB0C_SERCOM5_PAD2 MCHP_PINMUX(b, 0, c, periph)

#define PB0D_SERCOM7_PAD2 MCHP_PINMUX(b, 0, d, periph)

#define PB0F_TCC5_WO0 MCHP_PINMUX(b, 0, f, periph)

#define PB0G_TCC3_WO4 MCHP_PINMUX(b, 0, g, periph)

#define PB0H_CAN1_TX MCHP_PINMUX(b, 0, h, periph)

#define PB0I_SDMMC0_SDWP MCHP_PINMUX(b, 0, i, periph)

#define PB0J_SPI_IXS_SDO MCHP_PINMUX(b, 0, j, periph)

#define PB0N_PTC_DRV4 MCHP_PINMUX(b, 0, n, periph)

#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

#define PB1B_ADC_VREFP0 MCHP_PINMUX(b, 1, b, periph)

#define PB1C_SERCOM5_PAD3 MCHP_PINMUX(b, 1, c, periph)

#define PB1D_SERCOM7_PAD3 MCHP_PINMUX(b, 1, d, periph)

#define PB1F_TCC5_WO1 MCHP_PINMUX(b, 1, f, periph)

#define PB1G_TCC3_WO5 MCHP_PINMUX(b, 1, g, periph)

#define PB1H_CAN1_RX MCHP_PINMUX(b, 1, h, periph)

#define PB1N_PTC_DRV5 MCHP_PINMUX(b, 1, n, periph)

#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

